# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Prometheus_Ed\Documents\GitHub\Homemade_Joystick\Homemade_Joystick_Workspace\Joystick_Groundup.cydsn\Joystick_Groundup.cyprj
# Date: Sun, 21 Jan 2018 00:15:41 GMT
#set_units -time ns
create_clock -name {ADC_SAR_Seq_1_IntClock(routed)} -period 541.66666666666663 -waveform {0 270.833333333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {ADC_SAR_Seq_1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 13 27} -nominal_period 541.66666666666663 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {DEBUG_UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 53} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_1}]]


# Component constraints for C:\Users\Prometheus_Ed\Documents\GitHub\Homemade_Joystick\Homemade_Joystick_Workspace\Joystick_Groundup.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Prometheus_Ed\Documents\GitHub\Homemade_Joystick\Homemade_Joystick_Workspace\Joystick_Groundup.cydsn\Joystick_Groundup.cyprj
# Date: Sun, 21 Jan 2018 00:15:28 GMT
