# THIS FILE IS AUTOMATICALLY GENERATED
# Project: P:\My_Documents\business\Prometheus_EducationLLC\Tutorials\MCU101_Cypresss\SW_Working_Directory\MCU101_Cypress_PSOC5_Labs\CyController\CyController1.cydsn\CyController1.cyprj
# Date: Sat, 23 Dec 2017 17:32:19 GMT
#set_units -time ns
create_clock -name {ADC_IntClock(routed)} -period 791.66666666666663 -waveform {0 395.833333333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {ADC_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 19 39} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {DEBUG_UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 53 105} -nominal_period 2166.6666666666665 [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 65537 131073} [list [get_pins {ClockBlock/dclk_glb_2}]]


# Component constraints for P:\My_Documents\business\Prometheus_EducationLLC\Tutorials\MCU101_Cypresss\SW_Working_Directory\MCU101_Cypress_PSOC5_Labs\CyController\CyController1.cydsn\TopDesign\TopDesign.cysch
# Project: P:\My_Documents\business\Prometheus_EducationLLC\Tutorials\MCU101_Cypresss\SW_Working_Directory\MCU101_Cypress_PSOC5_Labs\CyController\CyController1.cydsn\CyController1.cyprj
# Date: Sat, 23 Dec 2017 17:31:54 GMT
